
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 0 to change, 3 to destroy.</code></pre>

* Create
  * module.terraform_executor_gcp_service_account.google_project_iam_member.terraform_executor_owner
  * module.terraform_executor_gcp_service_account.google_service_account.terraform_executor
  * module.terraform_executor_gcp_service_account.google_service_account_iam_binding.terraform_workload_identity
* Delete
  * google_service_account.terraform_executor
  * google_service_account_iam_binding.terraform_workload_identity
* Replace
  * google_project_iam_member.terraform_executor_owner


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_project_iam_member.terraform_executor_owner must be replaced
-/+ resource "google_project_iam_member" "terraform_executor_owner" {
      ~ etag    = "BwX+ljlN344=" -> (known after apply)
      ~ id      = "sap-kyma-prow/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> (known after apply)
      ~ member  = "serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> (known after apply) # forces replacement
      ~ project = "sap-kyma-prow" -> "sap-kyma-prow-workloads" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # google_service_account.terraform_executor will be destroyed
  # (because google_service_account.terraform_executor is not in configuration)
  - resource "google_service_account" "terraform_executor" {
      - account_id   = "terraform-executor" -> null
      - description  = "Identity of terraform executor. It's mapped to k8s service account through workload identity." -> null
      - disabled     = false -> null
      - display_name = "terraform-executor" -> null
      - email        = "terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> null
      - id           = "projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> null
      - name         = "projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> null
      - project      = "sap-kyma-prow" -> null
      - unique_id    = "111120729876190154730" -> null
    }

  # google_service_account_iam_binding.terraform_workload_identity will be destroyed
  # (because google_service_account_iam_binding.terraform_workload_identity is not in configuration)
  - resource "google_service_account_iam_binding" "terraform_workload_identity" {
      - etag               = "BwX+ljkNaeU=" -> null
      - id                 = "projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser" -> null
      - members            = [
          - "serviceAccount:sap-kyma-prow.svc.id.goog[default/terraform-executor]",
        ] -> null
      - role               = "roles/iam.workloadIdentityUser" -> null
      - service_account_id = "projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" -> null
    }

  # module.terraform_executor_gcp_service_account.google_project_iam_member.terraform_executor_owner will be created
  + resource "google_project_iam_member" "terraform_executor_owner" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "sap-kyma-prow"
      + role    = "roles/owner"
    }

  # module.terraform_executor_gcp_service_account.google_service_account.terraform_executor will be created
  + resource "google_service_account" "terraform_executor" {
      + account_id   = "terraform-executor"
      + description  = "Identity of terraform executor. It's mapped to k8s service account through workload identity."
      + disabled     = false
      + display_name = "terraform-executor"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # module.terraform_executor_gcp_service_account.google_service_account_iam_binding.terraform_workload_identity will be created
  + resource "google_service_account_iam_binding" "terraform_workload_identity" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:sap-kyma-prow.svc.id.goog[default/terraform-executor]",
        ]
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

Plan: 4 to add, 0 to change, 3 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.tekton_terraform_executor_k8s_service_account.kubernetes_service_account.terraform_executor has changed
  ~ resource "kubernetes_service_account" "terraform_executor" {
        id                              = "default/terraform-executor"
        # (1 unchanged attribute hidden)

      ~ metadata {
          + labels           = {}
            name             = "terraform-executor"
            # (5 unchanged attributes hidden)
        }
    }

  # module.trusted_workload_terraform_executor_k8s_service_account.kubernetes_service_account.terraform_executor has changed
  ~ resource "kubernetes_service_account" "terraform_executor" {
        id                              = "default/terraform-executor"
        # (1 unchanged attribute hidden)

      ~ metadata {
          + labels           = {}
            name             = "terraform-executor"
            # (5 unchanged attributes hidden)
        }
    }

  # module.untrusted_workload_terraform_executor_k8s_service_account.kubernetes_service_account.terraform_executor has changed
  ~ resource "kubernetes_service_account" "terraform_executor" {
        id                              = "default/terraform-executor"
        # (1 unchanged attribute hidden)

      ~ metadata {
          + labels           = {}
            name             = "terraform-executor"
            # (5 unchanged attributes hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>


## :warning: Warnings :warning:

```hcl
Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

  with module.untrusted_workload_terraform_executor_k8s_service_account.kubernetes_service_account.terraform_executor,
  on ../../../../development/terraform-executor/terraform/modules/k8s-terraform-executor/main.tf line 15, in resource "kubernetes_service_account" "terraform_executor":
  15: resource "kubernetes_service_account" "terraform_executor" {

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

(and 2 more similar warnings elsewhere)

```



<!-- github-comment: {"Command":"plan","PRNumber":7909,"Program":"tfcmt","SHA1":"08b790742542831cbd8f23a26977e66dec12b84e","Vars":{}} -->